insert into students (name, group_name, isu, dormitory, room, term, international, note) values
    ('Петрова Анна Сергеевна', 'P3220', '338922', 2, '305', '2024-09-01', false, ''),
    ('Ли Вэй', 'M3301', '401122', 8, '1205', '2025-09-01', true, 'Изучает русский язык'),
    ('Нгуен Ван Ань', 'K3201', '402233', 8, '1410', '2025-02-10', true, ''),
    ('Сидоров Алексей Петрович', 'M3302', '345678', 5, '212', '2023-09-01', false, 'Попросил переселить на другой этаж'),
    ('Козлова Мария Андреевна', 'P3221', '356789', 2, '507', '2025-08-28', false, ''),
    ('Ахмедов Тимур Русланович', 'M3301', '405566', 8, '1502', '2025-08-30', true, ''),
    ('Smith John', 'K3202', '403344', 3, '907', '2024-12-20', true, 'Учится по обмену до лета'),
    ('Волкова Дарья Олеговна', 'M4101', '367890', 1, '110', '2026-09-01', false, 'Магистрант первого курса'),
    ('Ёлкин Пётр Ильич', 'P3220', '371234', 4, '1001', '2024-09-01', false, ''),
    ('Егоров Иван Дмитриевич', 'M3302', '372345', 5, '214', '2023-09-01', false, ''),
    ('Римская-Корсакова Ольга Петровна', 'K3201', '373456', 2, '612', '2025-09-01', false, ''),
    ('O''Neil Sean', 'M3301', '404455', 8, '1503', '2026-02-01', true, 'Ирландия');
